


-- —татистики јлиса, Ѕелла, ¬ика и √алина нумеруют строки у таблицы Product.
-- ¬се четверо упор€дочили строки таблицы по возрастанию названий производителей.
-- јлиса присваивает новый номер каждой строке, строки одного производител€ она упор€дочивает по номеру модели.
-- “рое остальных присваивают один и тот же номер всем строкам одного производител€.
-- Ѕелла присваивает номера начина€ с единицы, каждый следующий производитель увеличивает номер на 1.
-- ” ¬ики каждый следующий производитель получает такой же номер, какой получила бы перва€ модель этого производител€ у јлисы.
-- √алина присваивает каждому следующему производителю тот же номер, который получила бы его последн€€ модель у јлисы.
-- ¬ывести: maker, model, номера строк получившиес€ у јлисы, Ѕеллы, ¬ики и √алины соответственно. 
