

-- Дима и Миша пользуются продуктами от одного и того же производителя.
-- Тип Таниного принтера не такой, как у Вити, но признак "цветной или нет" - совпадает.
-- Размер экрана Диминого ноутбука на 3 дюйма больше Олиного.
-- Мишин ПК в 4 раза дороже Таниного принтера.
-- Номера моделей Витиного принтера и Олиного ноутбука отличаются только третьим символом.
-- У Костиного ПК скорость процессора, как у Мишиного ПК; объем жесткого диска, как у Диминого ноутбука; объем памяти, как у Олиного ноутбука, а цена - как у Витиного принтера.
-- Вывести все возможные номера моделей Костиного ПК.

